---
kind: property
id: P:Autodesk.Revit.DB.DWFExportOptions.ExportOnlyViewId
source: html/a682bcfd-47a8-be6c-482f-ec7e5334172a.htm
---
# Autodesk.Revit.DB.DWFExportOptions.ExportOnlyViewId Property

Only export the specified view.

## Syntax (C#)
```csharp
public ElementId ExportOnlyViewId { get; set; }
```

## Remarks
Export only the specified view, but the data of the other views is still used, e. g. the hyperlink information.